Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic class is a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic for lines.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.MaxSegmentsCount
The maximum number of segments that can be drawn as lines.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.MinSegmentsCount
The minimum number of segments that can be drawn as a single polyline.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.#ctor(System.Collections.Generic.IReadOnlyList{Tekla.Common.Geometry.Segment3},Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic class.
segments: The segments of the lines.
color: The color of the graphic.
lineWidth: The line width of the graphic.
lineType: The line type of the graphic.
isSnappable: A value indicating whether the lines graphic can be snapped to.
drawLightingEffect: A value indicating whether the polyline graphic has the lightinging effect.
useSecondaryColor: A value indicating whether to use the secondary color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.Segments
Gets the segments of the lines.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.Thickness
Gets the line width of the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.LineType
Gets the line type of the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.Get(System.Collections.Generic.IList{Tekla.Common.Geometry.Segment3},Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType,System.Boolean,System.Boolean,System.Boolean)
Gets the native lines graphic.
segments: The segments of the lines.
color: The color of the graphic.
lineWidth: The line width of the graphic.
lineType: The line type of the graphic.
isSnappable: A value indicating whether the lines graphic can be snapped to.
drawLightingEffect: A value indicating whether the polyline graphic has the lightinging effect.
useSecondaryColor: A value indicating whether to use the secondary color.
Returns: A new instance of Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.AssertSegments(System.Collections.Generic.ICollection{Tekla.Common.Geometry.Segment3},System.Int32,System.Int32)
Asserts the segments.
segments: The segments.
minCount: The minimum count.
maxCount: The maximum count.
Returns: True if the segments data is valid; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.GetPoints
Gets the native points forming the lines graphic.
Returns: The native points forming the lines graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.Draw(System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws the graphic.
identifier: The identifier to use when drawing the graphic.
view: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view to draw to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.DrawLines(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary lines command.
argument: The argument.
Returns: Greater than 0 on success.